[Killed] StringLiteral
packages/orchestration/src/workflow.ts:39:9
 ) => Promise<Record<string, unknown>>;
 
 const DEFAULT_WORKFLOW: WorkflowDefinition = {
-  name: "enterprise-feature",
+  name: "",
   description: "Default SDLC workflow (master prompt §22)",
   stages: [
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (28.4882ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (21.9699ms)

✔ all-lowRiskSkip run completes immediately on advance (20.3601ms)

✔ template registry loads shipped workflow templates without issues (90.0949ms)

[Survived] ObjectLiteral
packages/orchestration/src/workflow.ts:43:5
   description: "Default SDLC workflow (master prompt §22)",
   stages: [
     { name: "discovery" },
-    { name: "requirements", agentRole: "requirements-engineer" },
+    {},
     { name: "architecture", agentRole: "architect" },
     { name: "planning", agentRole: "captain" },

[Survived] StringLiteral
packages/orchestration/src/workflow.ts:44:13
   stages: [
     { name: "discovery" },
     { name: "requirements", agentRole: "requirements-engineer" },
-    { name: "architecture", agentRole: "architect" },
+    { name: "", agentRole: "architect" },
     { name: "planning", agentRole: "captain" },
     { name: "implementation", agentRole: "backend-engineer", retry: { maxAttempts: 3 } },

[Survived] ObjectLiteral
packages/orchestration/src/workflow.ts:44:5
   stages: [
     { name: "discovery" },
     { name: "requirements", agentRole: "requirements-engineer" },
-    { name: "architecture", agentRole: "architect" },
+    {},
     { name: "planning", agentRole: "captain" },
     { name: "implementation", agentRole: "backend-engineer", retry: { maxAttempts: 3 } },

[Survived] StringLiteral
packages/orchestration/src/workflow.ts:45:36
     { name: "discovery" },
     { name: "requirements", agentRole: "requirements-engineer" },
     { name: "architecture", agentRole: "architect" },
-    { name: "planning", agentRole: "captain" },
+    { name: "planning", agentRole: "" },
     { name: "implementation", agentRole: "backend-engineer", retry: { maxAttempts: 3 } },
     { name: "review", agentRole: "code-reviewer" },

[Survived] StringLiteral
packages/orchestration/src/workflow.ts:45:13
     { name: "discovery" },
     { name: "requirements", agentRole: "requirements-engineer" },
     { name: "architecture", agentRole: "architect" },
-    { name: "planning", agentRole: "captain" },
+    { name: "", agentRole: "captain" },
     { name: "implementation", agentRole: "backend-engineer", retry: { maxAttempts: 3 } },
     { name: "review", agentRole: "code-reviewer" },

[Survived] ObjectLiteral
packages/orchestration/src/workflow.ts:46:5
     { name: "requirements", agentRole: "requirements-engineer" },
     { name: "architecture", agentRole: "architect" },
     { name: "planning", agentRole: "captain" },
-    { name: "implementation", agentRole: "backend-engineer", retry: { maxAttempts: 3 } },
+    {},
     { name: "review", agentRole: "code-reviewer" },
     { name: "security", agentRole: "security-engineer" },

[Survived] ObjectLiteral
packages/orchestration/src/workflow.ts:46:69
     { name: "requirements", agentRole: "requirements-engineer" },
     { name: "architecture", agentRole: "architect" },
     { name: "planning", agentRole: "captain" },
-    { name: "implementation", agentRole: "backend-engineer", retry: { maxAttempts: 3 } },
+    { name: "implementation", agentRole: "backend-engineer", retry: {} },
     { name: "review", agentRole: "code-reviewer" },
     { name: "security", agentRole: "security-engineer" },

[Survived] ObjectLiteral
packages/orchestration/src/workflow.ts:47:5
     { name: "architecture", agentRole: "architect" },
     { name: "planning", agentRole: "captain" },
     { name: "implementation", agentRole: "backend-engineer", retry: { maxAttempts: 3 } },
-    { name: "review", agentRole: "code-reviewer" },
+    {},
     { name: "security", agentRole: "security-engineer" },
     { name: "qa", agentRole: "qa-engineer" },

[Survived] StringLiteral
packages/orchestration/src/workflow.ts:48:36
     { name: "planning", agentRole: "captain" },
     { name: "implementation", agentRole: "backend-engineer", retry: { maxAttempts: 3 } },
     { name: "review", agentRole: "code-reviewer" },
-    { name: "security", agentRole: "security-engineer" },
+    { name: "security", agentRole: "" },
     { name: "qa", agentRole: "qa-engineer" },
     { name: "deployment", agentRole: "devops-engineer", approvalRequired: true, approvalAction: "deploy:staging" },

[Survived] ObjectLiteral
packages/orchestration/src/workflow.ts:48:5
     { name: "planning", agentRole: "captain" },
     { name: "implementation", agentRole: "backend-engineer", retry: { maxAttempts: 3 } },
     { name: "review", agentRole: "code-reviewer" },
-    { name: "security", agentRole: "security-engineer" },
+    {},
     { name: "qa", agentRole: "qa-engineer" },
     { name: "deployment", agentRole: "devops-engineer", approvalRequired: true, approvalAction: "deploy:staging" },

[Survived] StringLiteral
packages/orchestration/src/workflow.ts:49:30
     { name: "implementation", agentRole: "backend-engineer", retry: { maxAttempts: 3 } },
     { name: "review", agentRole: "code-reviewer" },
     { name: "security", agentRole: "security-engineer" },
-    { name: "qa", agentRole: "qa-engineer" },
+    { name: "qa", agentRole: "" },
     { name: "deployment", agentRole: "devops-engineer", approvalRequired: true, approvalAction: "deploy:staging" },
     { name: "monitoring", agentRole: "sre" },

[Survived] BooleanLiteral
packages/orchestration/src/workflow.ts:50:75
     { name: "review", agentRole: "code-reviewer" },
     { name: "security", agentRole: "security-engineer" },
     { name: "qa", agentRole: "qa-engineer" },
-    { name: "deployment", agentRole: "devops-engineer", approvalRequired: true, approvalAction: "deploy:staging" },
+    { name: "deployment", agentRole: "devops-engineer", approvalRequired: false, approvalAction: "deploy:staging" },
     { name: "monitoring", agentRole: "sre" },
   ],

[Killed] BlockStatement
packages/orchestration/src/workflow.ts:67:23
   private handlers = new Map<string, Map<string, StageHandler>>();
   private db: Db;
 
-  constructor(db: Db) {
-    this.db = db;
-  }
+  constructor(db: Db) {}
 
   registerHandler(workflowName: string, stage: string, handler: StageHandler): void {
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (25.7558ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (15.5366ms)

✖ all-lowRiskSkip run completes immediately on advance (18.7595ms)

✔ template registry loads shipped workflow templates without issues (55.2474ms)

[Killed] BlockStatement
packages/orchestration/src/workflow.ts:71:85
     this.db = db;
   }
 
-  registerHandler(workflowName: string, stage: string, handler: StageHandler): void {
-    let m = this.handlers.get(workflowName);
-    if (!m) {
-      m = new Map();
-      this.handlers.set(workflowName, m);
-    }
-    m.set(stage, handler);
-  }
+  registerHandler(workflowName: string, stage: string, handler: StageHandler): void {}
 
   parseDefinition(source: string): WorkflowDefinition {
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (24.182ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (15.4433ms)

✔ all-lowRiskSkip run completes immediately on advance (15.8049ms)

✔ template registry loads shipped workflow templates without issues (61.93ms)

[Killed] ConditionalExpression
packages/orchestration/src/workflow.ts:73:9
 
   registerHandler(workflowName: string, stage: string, handler: StageHandler): void {
     let m = this.handlers.get(workflowName);
-    if (!m) {
+    if (false) {
       m = new Map();
       this.handlers.set(workflowName, m);
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (23.5737ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (16.2417ms)

✔ all-lowRiskSkip run completes immediately on advance (19.7469ms)

✔ template registry loads shipped workflow templates without issues (60.048ms)

[Killed] BlockStatement
packages/orchestration/src/workflow.ts:73:13
 
   registerHandler(workflowName: string, stage: string, handler: StageHandler): void {
     let m = this.handlers.get(workflowName);
-    if (!m) {
-      m = new Map();
-      this.handlers.set(workflowName, m);
-    }
+    if (!m) {}
     m.set(stage, handler);
   }
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (22.8301ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (15.0596ms)

✔ all-lowRiskSkip run completes immediately on advance (17.959ms)

✔ template registry loads shipped workflow templates without issues (58.0502ms)

[Killed] CallExpression
packages/orchestration/src/workflow.ts:75:7
     let m = this.handlers.get(workflowName);
     if (!m) {
       m = new Map();
-      this.handlers.set(workflowName, m);
+      ;
     }
     m.set(stage, handler);
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (28.0291ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (16.6427ms)

✔ all-lowRiskSkip run completes immediately on advance (16.0843ms)

✔ template registry loads shipped workflow templates without issues (57.8117ms)

[Killed] CallExpression
packages/orchestration/src/workflow.ts:77:5
       m = new Map();
       this.handlers.set(workflowName, m);
     }
-    m.set(stage, handler);
+    ;
   }
 
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (23.2973ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (15.0085ms)

✔ all-lowRiskSkip run completes immediately on advance (16.339ms)

✔ template registry loads shipped workflow templates without issues (59.2931ms)

[Killed] BlockStatement
packages/orchestration/src/workflow.ts:80:55
     m.set(stage, handler);
   }
 
-  parseDefinition(source: string): WorkflowDefinition {
-    const raw = parse(source) as {
-      workflow?: { name?: string; description?: string; stages?: WorkflowStageDef[] };
-      stages?: WorkflowStageDef[];
-      name?: string;
-    };
-    const body = raw.workflow ?? raw;
-    if (!body?.name || !Array.isArray(body.stages) || body.stages.length === 0) {
-      throw new AppError("VALIDATION_ERROR", "workflow definition must have a name and ≥1 stage");
-    }
-    return body as unknown as WorkflowDefinition;
-  }
+  parseDefinition(source: string): WorkflowDefinition {}
 
   start(
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (27.2781ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (16.5638ms)

✔ all-lowRiskSkip run completes immediately on advance (17.6257ms)

✖ template registry loads shipped workflow templates without issues (18.4844ms)

[Killed] LogicalOperator
packages/orchestration/src/workflow.ts:86:18
       stages?: WorkflowStageDef[];
       name?: string;
     };
-    const body = raw.workflow ?? raw;
+    const body = raw.workflow && raw;
     if (!body?.name || !Array.isArray(body.stages) || body.stages.length === 0) {
       throw new AppError("VALIDATION_ERROR", "workflow definition must have a name and ≥1 stage");
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (28.5293ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (16.6879ms)

✔ all-lowRiskSkip run completes immediately on advance (16.4069ms)

✖ template registry loads shipped workflow templates without issues (31.0158ms)

[Killed] ConditionalExpression
packages/orchestration/src/workflow.ts:87:55
       name?: string;
     };
     const body = raw.workflow ?? raw;
-    if (!body?.name || !Array.isArray(body.stages) || body.stages.length === 0) {
+    if (!body?.name || !Array.isArray(body.stages) || false) {
       throw new AppError("VALIDATION_ERROR", "workflow definition must have a name and ≥1 stage");
     }
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (38.4186ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (16.948ms)

✔ all-lowRiskSkip run completes immediately on advance (18.0947ms)

✔ template registry loads shipped workflow templates without issues (57.133ms)

[Killed] ConditionalExpression
packages/orchestration/src/workflow.ts:87:9
       name?: string;
     };
     const body = raw.workflow ?? raw;
-    if (!body?.name || !Array.isArray(body.stages) || body.stages.length === 0) {
+    if (false) {
       throw new AppError("VALIDATION_ERROR", "workflow definition must have a name and ≥1 stage");
     }
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (27.3543ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (16.4619ms)

✔ all-lowRiskSkip run completes immediately on advance (15.787ms)

✔ template registry loads shipped workflow templates without issues (62.9079ms)

[Killed] BlockStatement
packages/orchestration/src/workflow.ts:102:64
       correlationId?: string;
       riskTier?: RiskTier;
     }
-  ): { runId: string; workflow: string; currentStage: string } {
-    const defn = opts.definition ?? DEFAULT_WORKFLOW;
-    const riskTier = opts.riskTier ?? "medium"; // conservative default
-    const runId = newId("wfr");
-    const now = this.db.now();
-    this.db.insert("workflow_runs", {
-      id: runId,
-      org_id: orgId,
-      project_id: opts.projectId ?? null,
-      workflow_name: defn.name,
-      current_stage: defn.stages[0]!.name,
-      status: "running",
-      state_json: JSON.stringify({
-        definition: defn,
-        riskTier,
-        completedStages: [],
-        ...opts.initialState,
-      }),
-      correlation_id: opts.correlationId ?? newId("cor"),
-      created_at: now,
-      updated_at: now,
-    });
-    return { runId, workflow: defn.name, currentStage: defn.stages[0]!.name };
-  }
+  ): { runId: string; workflow: string; currentStage: string } {}
 
   async advance(runId: string): Promise<{ status: string; currentStage: string | null }> {
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (26.9549ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (26.4023ms)

✖ all-lowRiskSkip run completes immediately on advance (16.3366ms)

✔ template registry loads shipped workflow templates without issues (76.5751ms)

[Killed] LogicalOperator
packages/orchestration/src/workflow.ts:103:18
       riskTier?: RiskTier;
     }
   ): { runId: string; workflow: string; currentStage: string } {
-    const defn = opts.definition ?? DEFAULT_WORKFLOW;
+    const defn = opts.definition && DEFAULT_WORKFLOW;
     const riskTier = opts.riskTier ?? "medium"; // conservative default
     const runId = newId("wfr");
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (23.8538ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (21.0101ms)

✖ all-lowRiskSkip run completes immediately on advance (21.4193ms)

✔ template registry loads shipped workflow templates without issues (67.095ms)

[Killed] LogicalOperator
packages/orchestration/src/workflow.ts:104:22
     }
   ): { runId: string; workflow: string; currentStage: string } {
     const defn = opts.definition ?? DEFAULT_WORKFLOW;
-    const riskTier = opts.riskTier ?? "medium"; // conservative default
+    const riskTier = opts.riskTier && "medium"; // conservative default
     const runId = newId("wfr");
     const now = this.db.now();
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (27.1034ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (21.7033ms)

✖ all-lowRiskSkip run completes immediately on advance (20.4157ms)

✔ template registry loads shipped workflow templates without issues (60.9475ms)

[Killed] StringLiteral
packages/orchestration/src/workflow.ts:107:20
     const riskTier = opts.riskTier ?? "medium"; // conservative default
     const runId = newId("wfr");
     const now = this.db.now();
-    this.db.insert("workflow_runs", {
+    this.db.insert("", {
       id: runId,
       org_id: orgId,
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (26.8587ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (17.4696ms)

✖ all-lowRiskSkip run completes immediately on advance (17.6825ms)

✔ template registry loads shipped workflow templates without issues (59.4522ms)

[Killed] LogicalOperator
packages/orchestration/src/workflow.ts:110:19
     this.db.insert("workflow_runs", {
       id: runId,
       org_id: orgId,
-      project_id: opts.projectId ?? null,
+      project_id: opts.projectId && null,
       workflow_name: defn.name,
       current_stage: defn.stages[0]!.name,
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (35.9172ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (15.0706ms)

✖ all-lowRiskSkip run completes immediately on advance (14.5796ms)

✔ template registry loads shipped workflow templates without issues (61.3548ms)

[Killed] ArrayDeclaration
packages/orchestration/src/workflow.ts:117:26
       state_json: JSON.stringify({
         definition: defn,
         riskTier,
-        completedStages: [],
+        completedStages: ["Stryker was here"],
         ...opts.initialState,
       }),
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (25.7101ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (16.9653ms)

✔ all-lowRiskSkip run completes immediately on advance (14.0547ms)

✔ template registry loads shipped workflow templates without issues (69.0716ms)

[Killed] LogicalOperator
packages/orchestration/src/workflow.ts:120:23
         completedStages: [],
         ...opts.initialState,
       }),
-      correlation_id: opts.correlationId ?? newId("cor"),
+      correlation_id: opts.correlationId && newId("cor"),
       created_at: now,
       updated_at: now,
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (25.5406ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (16.7299ms)

✖ all-lowRiskSkip run completes immediately on advance (16.3026ms)

✔ template registry loads shipped workflow templates without issues (56.0723ms)

[Killed] ObjectLiteral
packages/orchestration/src/workflow.ts:124:12
       created_at: now,
       updated_at: now,
     });
-    return { runId, workflow: defn.name, currentStage: defn.stages[0]!.name };
+    return {};
   }
 
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (24.8994ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (16.7507ms)

✖ all-lowRiskSkip run completes immediately on advance (16.3158ms)

✔ template registry loads shipped workflow templates without issues (58.5425ms)

[Killed] ConditionalExpression
packages/orchestration/src/workflow.ts:136:9
       status: string;
       state_json: string;
     }>("SELECT * FROM workflow_runs WHERE id = ?", [runId]);
-    if (!row) throw new AppError("NOT_FOUND", `workflow run ${runId} not found`);
+    if (false) throw new AppError("NOT_FOUND", `workflow run ${runId} not found`);
     if (row.status !== "running") {
       throw new AppError("CONFLICT", `run is ${row.status}; only running runs can advance`);
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (25.7414ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (17.2352ms)

✔ all-lowRiskSkip run completes immediately on advance (14.7928ms)

✔ template registry loads shipped workflow templates without issues (59.8992ms)

[Killed] BooleanLiteral
packages/orchestration/src/workflow.ts:136:9
       status: string;
       state_json: string;
     }>("SELECT * FROM workflow_runs WHERE id = ?", [runId]);
-    if (!row) throw new AppError("NOT_FOUND", `workflow run ${runId} not found`);
+    if (row) throw new AppError("NOT_FOUND", `workflow run ${runId} not found`);
     if (row.status !== "running") {
       throw new AppError("CONFLICT", `run is ${row.status}; only running runs can advance`);
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (24.9103ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (17.3979ms)

✖ all-lowRiskSkip run completes immediately on advance (16.8131ms)

✔ template registry loads shipped workflow templates without issues (56.4862ms)

[Killed] EqualityOperator
packages/orchestration/src/workflow.ts:137:9
       state_json: string;
     }>("SELECT * FROM workflow_runs WHERE id = ?", [runId]);
     if (!row) throw new AppError("NOT_FOUND", `workflow run ${runId} not found`);
-    if (row.status !== "running") {
+    if (row.status === "running") {
       throw new AppError("CONFLICT", `run is ${row.status}; only running runs can advance`);
     }
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (22.169ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (16.3548ms)

✖ all-lowRiskSkip run completes immediately on advance (15.8684ms)

✔ template registry loads shipped workflow templates without issues (58.5367ms)

[Killed] ConditionalExpression
packages/orchestration/src/workflow.ts:137:9
       state_json: string;
     }>("SELECT * FROM workflow_runs WHERE id = ?", [runId]);
     if (!row) throw new AppError("NOT_FOUND", `workflow run ${runId} not found`);
-    if (row.status !== "running") {
+    if (true) {
       throw new AppError("CONFLICT", `run is ${row.status}; only running runs can advance`);
     }
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (24.2255ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (15.7796ms)

✖ all-lowRiskSkip run completes immediately on advance (14.8273ms)

✔ template registry loads shipped workflow templates without issues (57.2072ms)

[Killed] LogicalOperator
packages/orchestration/src/workflow.ts:147:32
       riskTier?: RiskTier;
     } & Record<string, unknown>;
     const stages = state.definition.stages;
-    const riskTier: RiskTier = state.riskTier ?? "medium";
+    const riskTier: RiskTier = state.riskTier && "medium";
 
     // find index of current stage
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (26.2834ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (17.6493ms)

✖ all-lowRiskSkip run completes immediately on advance (15.3365ms)

✔ template registry loads shipped workflow templates without issues (57.6987ms)

[Survived] StringLiteral
packages/orchestration/src/workflow.ts:147:50
       riskTier?: RiskTier;
     } & Record<string, unknown>;
     const stages = state.definition.stages;
-    const riskTier: RiskTier = state.riskTier ?? "medium";
+    const riskTier: RiskTier = state.riskTier ?? "";
 
     // find index of current stage

[Killed] ArrowFunction
packages/orchestration/src/workflow.ts:150:32
     const riskTier: RiskTier = state.riskTier ?? "medium";
 
     // find index of current stage
-    let idx = stages.findIndex((s) => s.name === row.current_stage);
+    let idx = stages.findIndex(() => undefined);
     if (idx === -1) throw new AppError("INTERNAL", `unknown stage ${row.current_stage}`);
 
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (29.9209ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (17.0804ms)

✖ all-lowRiskSkip run completes immediately on advance (14.7619ms)

✔ template registry loads shipped workflow templates without issues (57.1793ms)

[Killed] ConditionalExpression
packages/orchestration/src/workflow.ts:150:39
     const riskTier: RiskTier = state.riskTier ?? "medium";
 
     // find index of current stage
-    let idx = stages.findIndex((s) => s.name === row.current_stage);
+    let idx = stages.findIndex((s) => false);
     if (idx === -1) throw new AppError("INTERNAL", `unknown stage ${row.current_stage}`);
 
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (23.5325ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (14.7749ms)

✖ all-lowRiskSkip run completes immediately on advance (16.5521ms)

✔ template registry loads shipped workflow templates without issues (61.3527ms)

[Killed] EqualityOperator
packages/orchestration/src/workflow.ts:151:9
 
     // find index of current stage
     let idx = stages.findIndex((s) => s.name === row.current_stage);
-    if (idx === -1) throw new AppError("INTERNAL", `unknown stage ${row.current_stage}`);
+    if (idx !== -1) throw new AppError("INTERNAL", `unknown stage ${row.current_stage}`);
 
     // Audit Phase 2.2 — risk-tier pruning: low-risk runs advance through
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (23.3542ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (14.9844ms)

✖ all-lowRiskSkip run completes immediately on advance (15.1695ms)

✔ template registry loads shipped workflow templates without issues (54.5816ms)

[Killed] UnaryOperator
packages/orchestration/src/workflow.ts:151:17
 
     // find index of current stage
     let idx = stages.findIndex((s) => s.name === row.current_stage);
-    if (idx === -1) throw new AppError("INTERNAL", `unknown stage ${row.current_stage}`);
+    if (idx === +1) throw new AppError("INTERNAL", `unknown stage ${row.current_stage}`);
 
     // Audit Phase 2.2 — risk-tier pruning: low-risk runs advance through
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (22.781ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (15.4659ms)

✔ all-lowRiskSkip run completes immediately on advance (15.737ms)

✔ template registry loads shipped workflow templates without issues (58.5733ms)

[Killed] LogicalOperator
packages/orchestration/src/workflow.ts:156:12
     // Audit Phase 2.2 — risk-tier pruning: low-risk runs advance through
     // stages flagged lowRiskSkip without executing them, checkpointing each skip
     // so the run state stays consistent and resumable.
-    while (idx < stages.length && riskTier === "low" && stages[idx]!.lowRiskSkip === true) {
+    while (idx < stages.length && riskTier === "low" || stages[idx]!.lowRiskSkip === true) {
       state.completedStages.push(stages[idx]!.name);
       idx++;
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (44.6139ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (22.251ms)

✔ all-lowRiskSkip run completes immediately on advance (25.6005ms)

✔ template registry loads shipped workflow templates without issues (79.7543ms)

[Killed] ConditionalExpression
packages/orchestration/src/workflow.ts:156:12
     // Audit Phase 2.2 — risk-tier pruning: low-risk runs advance through
     // stages flagged lowRiskSkip without executing them, checkpointing each skip
     // so the run state stays consistent and resumable.
-    while (idx < stages.length && riskTier === "low" && stages[idx]!.lowRiskSkip === true) {
+    while (true && stages[idx]!.lowRiskSkip === true) {
       state.completedStages.push(stages[idx]!.name);
       idx++;
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (27.4499ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (17.5382ms)

✔ all-lowRiskSkip run completes immediately on advance (14.5872ms)

✔ template registry loads shipped workflow templates without issues (55.5959ms)

[Killed] CallExpression
packages/orchestration/src/workflow.ts:157:7
     // stages flagged lowRiskSkip without executing them, checkpointing each skip
     // so the run state stays consistent and resumable.
     while (idx < stages.length && riskTier === "low" && stages[idx]!.lowRiskSkip === true) {
-      state.completedStages.push(stages[idx]!.name);
+      ;
       idx++;
       if (idx >= stages.length) {
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (26.9907ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (20.2785ms)

✔ all-lowRiskSkip run completes immediately on advance (16.6541ms)

✔ template registry loads shipped workflow templates without issues (61.9627ms)

[Killed] UpdateOperator
packages/orchestration/src/workflow.ts:158:7
     // so the run state stays consistent and resumable.
     while (idx < stages.length && riskTier === "low" && stages[idx]!.lowRiskSkip === true) {
       state.completedStages.push(stages[idx]!.name);
-      idx++;
+      idx--;
       if (idx >= stages.length) {
         this.db.transaction(() => {
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (24.5031ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (14.7897ms)

✖ all-lowRiskSkip run completes immediately on advance (13.6235ms)

✔ template registry loads shipped workflow templates without issues (56.166ms)
