[Killed] ConditionalExpression
packages/orchestration/src/workflow.ts:159:11
     while (idx < stages.length && riskTier === "low" && stages[idx]!.lowRiskSkip === true) {
       state.completedStages.push(stages[idx]!.name);
       idx++;
-      if (idx >= stages.length) {
+      if (false) {
         this.db.transaction(() => {
           this.persistState(runId, state, "__done__");
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (25.3956ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (15.6596ms)

✖ all-lowRiskSkip run completes immediately on advance (26.6389ms)

✔ template registry loads shipped workflow templates without issues (57.9195ms)

[Killed] EqualityOperator
packages/orchestration/src/workflow.ts:159:11
     while (idx < stages.length && riskTier === "low" && stages[idx]!.lowRiskSkip === true) {
       state.completedStages.push(stages[idx]!.name);
       idx++;
-      if (idx >= stages.length) {
+      if (idx > stages.length) {
         this.db.transaction(() => {
           this.persistState(runId, state, "__done__");
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (26.3614ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (24.455ms)

✖ all-lowRiskSkip run completes immediately on advance (15.6715ms)

✔ template registry loads shipped workflow templates without issues (54.3809ms)

[Survived] BlockStatement
packages/orchestration/src/workflow.ts:160:35
       state.completedStages.push(stages[idx]!.name);
       idx++;
       if (idx >= stages.length) {
-        this.db.transaction(() => {
-          this.persistState(runId, state, "__done__");
-          this.setStatus(runId, "succeeded");
-        });
+        this.db.transaction(() => {});
         return { status: "succeeded", currentStage: null };
       }

[Killed] StringLiteral
packages/orchestration/src/workflow.ts:162:33
       if (idx >= stages.length) {
         this.db.transaction(() => {
           this.persistState(runId, state, "__done__");
-          this.setStatus(runId, "succeeded");
+          this.setStatus(runId, "");
         });
         return { status: "succeeded", currentStage: null };
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (23.9257ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (15.651ms)

✖ all-lowRiskSkip run completes immediately on advance (14.7234ms)

✔ template registry loads shipped workflow templates without issues (53.5131ms)

[Killed] ObjectLiteral
packages/orchestration/src/workflow.ts:164:16
           this.persistState(runId, state, "__done__");
           this.setStatus(runId, "succeeded");
         });
-        return { status: "succeeded", currentStage: null };
+        return {};
       }
       this.persistState(runId, state, stages[idx]!.name);
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (23.5028ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (22.5017ms)

✖ all-lowRiskSkip run completes immediately on advance (19.9916ms)

✔ template registry loads shipped workflow templates without issues (53.9579ms)

[Survived] CallExpression
packages/orchestration/src/workflow.ts:166:7
         });
         return { status: "succeeded", currentStage: null };
       }
-      this.persistState(runId, state, stages[idx]!.name);
+      ;
     }
 

[Killed] ConditionalExpression
packages/orchestration/src/workflow.ts:173:9
 
     // Audit Phase 3.2 — parallel fan-out: branch handlers run concurrently and
     // the run only converges when every branch has completed.
-    if (stage.fanOut && stage.fanOut.length > 0) {
+    if (true) {
       return this.advanceFanOut(runId, state, stages, idx, stage);
     }
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (29.0703ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (19.3556ms)

✔ all-lowRiskSkip run completes immediately on advance (15.3622ms)

✔ template registry loads shipped workflow templates without issues (55.5089ms)

[Killed] ConditionalExpression
packages/orchestration/src/workflow.ts:173:9
 
     // Audit Phase 3.2 — parallel fan-out: branch handlers run concurrently and
     // the run only converges when every branch has completed.
-    if (stage.fanOut && stage.fanOut.length > 0) {
+    if (false) {
       return this.advanceFanOut(runId, state, stages, idx, stage);
     }
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (22.7497ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (15.8477ms)

✔ all-lowRiskSkip run completes immediately on advance (17.2987ms)

✔ template registry loads shipped workflow templates without issues (52.4281ms)

[Killed] OptionalChaining
packages/orchestration/src/workflow.ts:177:21
       return this.advanceFanOut(runId, state, stages, idx, stage);
     }
 
-    const handler = this.handlers.get(state.definition.name)?.get(stage.name);
+    const handler = this.handlers.get(state.definition.name).get(stage.name);
     if (!handler) {
       this.setStatus(runId, "blocked");
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (23.9328ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (17.0218ms)

✔ all-lowRiskSkip run completes immediately on advance (14.858ms)

✔ template registry loads shipped workflow templates without issues (57.9263ms)

[Killed] ConditionalExpression
packages/orchestration/src/workflow.ts:178:9
     }
 
     const handler = this.handlers.get(state.definition.name)?.get(stage.name);
-    if (!handler) {
+    if (true) {
       this.setStatus(runId, "blocked");
       throw new AppError("DEPENDENCY_UNAVAILABLE", `no handler registered for stage '${stage.name}'`);
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (28.9567ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (15.3617ms)

✔ all-lowRiskSkip run completes immediately on advance (21.7463ms)

✔ template registry loads shipped workflow templates without issues (62.4798ms)

[Killed] BooleanLiteral
packages/orchestration/src/workflow.ts:178:9
     }
 
     const handler = this.handlers.get(state.definition.name)?.get(stage.name);
-    if (!handler) {
+    if (handler) {
       this.setStatus(runId, "blocked");
       throw new AppError("DEPENDENCY_UNAVAILABLE", `no handler registered for stage '${stage.name}'`);
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (25.6493ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (16.6061ms)

✔ all-lowRiskSkip run completes immediately on advance (16.0845ms)

✔ template registry loads shipped workflow templates without issues (66.6718ms)

[Killed] StringLiteral
packages/orchestration/src/workflow.ts:179:29
 
     const handler = this.handlers.get(state.definition.name)?.get(stage.name);
     if (!handler) {
-      this.setStatus(runId, "blocked");
+      this.setStatus(runId, "");
       throw new AppError("DEPENDENCY_UNAVAILABLE", `no handler registered for stage '${stage.name}'`);
     }
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (24.5089ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (16.4065ms)

✔ all-lowRiskSkip run completes immediately on advance (15.8792ms)

✔ template registry loads shipped workflow templates without issues (54.518ms)

[Survived] StringLiteral
packages/orchestration/src/workflow.ts:180:26
     const handler = this.handlers.get(state.definition.name)?.get(stage.name);
     if (!handler) {
       this.setStatus(runId, "blocked");
-      throw new AppError("DEPENDENCY_UNAVAILABLE", `no handler registered for stage '${stage.name}'`);
+      throw new AppError("", `no handler registered for stage '${stage.name}'`);
     }
 

[Survived] BlockStatement
packages/orchestration/src/workflow.ts:184:9
     }
 
     let output: Record<string, unknown>;
-    try {
-      output = await handler(stage.name, state);
-    } catch (e) {
+    try {} catch (e) {
       this.setStatus(runId, "failed");
       throw new AppError("INTERNAL", `stage '${stage.name}' failed`, { cause: e });

[Survived] BlockStatement
packages/orchestration/src/workflow.ts:186:17
     let output: Record<string, unknown>;
     try {
       output = await handler(stage.name, state);
-    } catch (e) {
-      this.setStatus(runId, "failed");
-      throw new AppError("INTERNAL", `stage '${stage.name}' failed`, { cause: e });
-    }
+    } catch (e) {}
 
     state.completedStages.push(stage.name);

[Survived] ObjectLiteral
packages/orchestration/src/workflow.ts:188:70
       output = await handler(stage.name, state);
     } catch (e) {
       this.setStatus(runId, "failed");
-      throw new AppError("INTERNAL", `stage '${stage.name}' failed`, { cause: e });
+      throw new AppError("INTERNAL", `stage '${stage.name}' failed`, {});
     }
 

[Killed] CallExpression
packages/orchestration/src/workflow.ts:191:5
       throw new AppError("INTERNAL", `stage '${stage.name}' failed`, { cause: e });
     }
 
-    state.completedStages.push(stage.name);
+    ;
     Object.assign(state, output);
 
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (22.9157ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (14.6436ms)

✔ all-lowRiskSkip run completes immediately on advance (16.356ms)

✔ template registry loads shipped workflow templates without issues (54.2328ms)

[Survived] CallExpression
packages/orchestration/src/workflow.ts:192:5
     }
 
     state.completedStages.push(stage.name);
-    Object.assign(state, output);
+    ;
 
     const nextIdx = idx + 1;

[Killed] ArithmeticOperator
packages/orchestration/src/workflow.ts:194:21
     state.completedStages.push(stage.name);
     Object.assign(state, output);
 
-    const nextIdx = idx + 1;
+    const nextIdx = idx - 1;
     if (nextIdx >= stages.length) {
       this.db.transaction(() => {
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (33.5997ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (24.5784ms)

✔ all-lowRiskSkip run completes immediately on advance (25.3405ms)

✔ template registry loads shipped workflow templates without issues (81.399ms)

[Killed] BlockStatement
packages/orchestration/src/workflow.ts:195:35
     Object.assign(state, output);
 
     const nextIdx = idx + 1;
-    if (nextIdx >= stages.length) {
-      this.db.transaction(() => {
-        this.persistState(runId, state, "__done__");
-        this.setStatus(runId, "succeeded");
-      });
-      return { status: "succeeded", currentStage: null };
-    }
+    if (nextIdx >= stages.length) {}
 
     const next = stages[nextIdx]!;
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (22.137ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (17.0061ms)

✔ all-lowRiskSkip run completes immediately on advance (15.7691ms)

✔ template registry loads shipped workflow templates without issues (56.9754ms)

[Killed] ConditionalExpression
packages/orchestration/src/workflow.ts:195:9
     Object.assign(state, output);
 
     const nextIdx = idx + 1;
-    if (nextIdx >= stages.length) {
+    if (true) {
       this.db.transaction(() => {
         this.persistState(runId, state, "__done__");
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (39.1556ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (23.4059ms)

✔ all-lowRiskSkip run completes immediately on advance (19.4064ms)

✔ template registry loads shipped workflow templates without issues (73.9455ms)

[Killed] BlockStatement
packages/orchestration/src/workflow.ts:196:33
 
     const nextIdx = idx + 1;
     if (nextIdx >= stages.length) {
-      this.db.transaction(() => {
-        this.persistState(runId, state, "__done__");
-        this.setStatus(runId, "succeeded");
-      });
+      this.db.transaction(() => {});
       return { status: "succeeded", currentStage: null };
     }
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (28.1924ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (21.6663ms)

✔ all-lowRiskSkip run completes immediately on advance (15.4092ms)

✔ template registry loads shipped workflow templates without issues (57.2197ms)

[Killed] StringLiteral
packages/orchestration/src/workflow.ts:200:24
         this.persistState(runId, state, "__done__");
         this.setStatus(runId, "succeeded");
       });
-      return { status: "succeeded", currentStage: null };
+      return { status: "", currentStage: null };
     }
 
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (24.3685ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (16.4437ms)

✔ all-lowRiskSkip run completes immediately on advance (23.7163ms)

✔ template registry loads shipped workflow templates without issues (62.1258ms)

[Killed] CallExpression
packages/orchestration/src/workflow.ts:204:5
     }
 
     const next = stages[nextIdx]!;
-    this.persistState(runId, state, next.name);
+    ;
     return { status: "running", currentStage: next.name };
   }
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (25.1746ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (21.3702ms)

✔ all-lowRiskSkip run completes immediately on advance (17.5545ms)

✔ template registry loads shipped workflow templates without issues (60.7078ms)

[Survived] StringLiteral
packages/orchestration/src/workflow.ts:205:22
 
     const next = stages[nextIdx]!;
     this.persistState(runId, state, next.name);
-    return { status: "running", currentStage: next.name };
+    return { status: "", currentStage: next.name };
   }
 

[Killed] BlockStatement
packages/orchestration/src/workflow.ts:222:9
     stage: WorkflowStageDef
   ): Promise<{ status: string; currentStage: string | null }> {
     const workflowName = state.definition.name;
-    try {
-      const branches = await Promise.all(
-        (stage.fanOut ?? []).map(async (branch) => {
-          const h = this.handlers.get(workflowName)?.get(branch.name);
-          if (!h) {
-            throw new AppError("DEPENDENCY_UNAVAILABLE", `no handler registered for fan-out branch '${branch.name}'`);
-          }
-          try {
-            const output = await h(branch.name, { ...state, $branch: branch.name, $fanOut: stage.name });
-            return { branch: branch.name, output };
-          } catch (e) {
-            throw new AppError("INTERNAL", `branch '${branch.name}' (fan-out '${stage.name}') failed`, { cause: e });
-          }
-        })
-      );
-      state[stage.name] = Object.fromEntries(branches.map((b) => [b.branch, b.output]));
-      for (const b of branches) state.completedStages.push(b.branch);
-      state.completedStages.push(stage.name);
-    } catch (e) {
+    try {} catch (e) {
       this.setStatus(runId, "failed");
       throw e instanceof AppError ? e : new AppError("INTERNAL", `fan-out '${stage.name}' failed`, { cause: e });
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (26.0728ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (16.6949ms)

✔ all-lowRiskSkip run completes immediately on advance (15.5705ms)

✔ template registry loads shipped workflow templates without issues (95.6319ms)

[Killed] BlockStatement
packages/orchestration/src/workflow.ts:224:52
     const workflowName = state.definition.name;
     try {
       const branches = await Promise.all(
-        (stage.fanOut ?? []).map(async (branch) => {
-          const h = this.handlers.get(workflowName)?.get(branch.name);
-          if (!h) {
-            throw new AppError("DEPENDENCY_UNAVAILABLE", `no handler registered for fan-out branch '${branch.name}'`);
-          }
-          try {
-            const output = await h(branch.name, { ...state, $branch: branch.name, $fanOut: stage.name });
-            return { branch: branch.name, output };
-          } catch (e) {
-            throw new AppError("INTERNAL", `branch '${branch.name}' (fan-out '${stage.name}') failed`, { cause: e });
-          }
-        })
+        (stage.fanOut ?? []).map(async (branch) => {})
       );
       state[stage.name] = Object.fromEntries(branches.map((b) => [b.branch, b.output]));
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (34.2224ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (18.3577ms)

✔ all-lowRiskSkip run completes immediately on advance (16.0716ms)

✔ template registry loads shipped workflow templates without issues (56.4406ms)

[Killed] LogicalOperator
packages/orchestration/src/workflow.ts:224:10
     const workflowName = state.definition.name;
     try {
       const branches = await Promise.all(
-        (stage.fanOut ?? []).map(async (branch) => {
+        (stage.fanOut && []).map(async (branch) => {
           const h = this.handlers.get(workflowName)?.get(branch.name);
           if (!h) {
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (27.3032ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (23.1793ms)

✔ all-lowRiskSkip run completes immediately on advance (15.9991ms)

✔ template registry loads shipped workflow templates without issues (55.6999ms)

[Survived] OptionalChaining
packages/orchestration/src/workflow.ts:225:21
     try {
       const branches = await Promise.all(
         (stage.fanOut ?? []).map(async (branch) => {
-          const h = this.handlers.get(workflowName)?.get(branch.name);
+          const h = this.handlers.get(workflowName).get(branch.name);
           if (!h) {
             throw new AppError("DEPENDENCY_UNAVAILABLE", `no handler registered for fan-out branch '${branch.name}'`);

[Killed] ConditionalExpression
packages/orchestration/src/workflow.ts:226:15
       const branches = await Promise.all(
         (stage.fanOut ?? []).map(async (branch) => {
           const h = this.handlers.get(workflowName)?.get(branch.name);
-          if (!h) {
+          if (true) {
             throw new AppError("DEPENDENCY_UNAVAILABLE", `no handler registered for fan-out branch '${branch.name}'`);
           }
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (25.1181ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (15.2366ms)

✔ all-lowRiskSkip run completes immediately on advance (17.0296ms)

✔ template registry loads shipped workflow templates without issues (58.5194ms)

[Killed] BooleanLiteral
packages/orchestration/src/workflow.ts:226:15
       const branches = await Promise.all(
         (stage.fanOut ?? []).map(async (branch) => {
           const h = this.handlers.get(workflowName)?.get(branch.name);
-          if (!h) {
+          if (h) {
             throw new AppError("DEPENDENCY_UNAVAILABLE", `no handler registered for fan-out branch '${branch.name}'`);
           }
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (30.1987ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (18.5022ms)

✔ all-lowRiskSkip run completes immediately on advance (22.7122ms)

✔ template registry loads shipped workflow templates without issues (60.2225ms)

[Survived] StringLiteral
packages/orchestration/src/workflow.ts:227:32
         (stage.fanOut ?? []).map(async (branch) => {
           const h = this.handlers.get(workflowName)?.get(branch.name);
           if (!h) {
-            throw new AppError("DEPENDENCY_UNAVAILABLE", `no handler registered for fan-out branch '${branch.name}'`);
+            throw new AppError("", `no handler registered for fan-out branch '${branch.name}'`);
           }
           try {

[Survived] StringLiteral
packages/orchestration/src/workflow.ts:227:58
         (stage.fanOut ?? []).map(async (branch) => {
           const h = this.handlers.get(workflowName)?.get(branch.name);
           if (!h) {
-            throw new AppError("DEPENDENCY_UNAVAILABLE", `no handler registered for fan-out branch '${branch.name}'`);
+            throw new AppError("DEPENDENCY_UNAVAILABLE", ``);
           }
           try {

[Killed] BlockStatement
packages/orchestration/src/workflow.ts:229:15
           if (!h) {
             throw new AppError("DEPENDENCY_UNAVAILABLE", `no handler registered for fan-out branch '${branch.name}'`);
           }
-          try {
-            const output = await h(branch.name, { ...state, $branch: branch.name, $fanOut: stage.name });
-            return { branch: branch.name, output };
-          } catch (e) {
+          try {} catch (e) {
             throw new AppError("INTERNAL", `branch '${branch.name}' (fan-out '${stage.name}') failed`, { cause: e });
           }
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (30.4653ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (17.6343ms)

✔ all-lowRiskSkip run completes immediately on advance (16.1144ms)

✔ template registry loads shipped workflow templates without issues (63.2768ms)

[Killed] BlockStatement
packages/orchestration/src/workflow.ts:232:23
           try {
             const output = await h(branch.name, { ...state, $branch: branch.name, $fanOut: stage.name });
             return { branch: branch.name, output };
-          } catch (e) {
-            throw new AppError("INTERNAL", `branch '${branch.name}' (fan-out '${stage.name}') failed`, { cause: e });
-          }
+          } catch (e) {}
         })
       );
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (25.4195ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (15.2652ms)

✔ all-lowRiskSkip run completes immediately on advance (15.4104ms)

✔ template registry loads shipped workflow templates without issues (62.5456ms)

[Killed] ArrowFunction
packages/orchestration/src/workflow.ts:237:59
           }
         })
       );
-      state[stage.name] = Object.fromEntries(branches.map((b) => [b.branch, b.output]));
+      state[stage.name] = Object.fromEntries(branches.map(() => undefined));
       for (const b of branches) state.completedStages.push(b.branch);
       state.completedStages.push(stage.name);
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (37.2005ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (18.1203ms)

✔ all-lowRiskSkip run completes immediately on advance (14.8286ms)

✔ template registry loads shipped workflow templates without issues (59.1854ms)

[Killed] CallExpression
packages/orchestration/src/workflow.ts:238:33
         })
       );
       state[stage.name] = Object.fromEntries(branches.map((b) => [b.branch, b.output]));
-      for (const b of branches) state.completedStages.push(b.branch);
+      for (const b of branches) ;
       state.completedStages.push(stage.name);
     } catch (e) {
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (27.989ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (21.5926ms)

✔ all-lowRiskSkip run completes immediately on advance (16.3641ms)

✔ template registry loads shipped workflow templates without issues (59.353ms)

[Killed] CallExpression
packages/orchestration/src/workflow.ts:239:7
       );
       state[stage.name] = Object.fromEntries(branches.map((b) => [b.branch, b.output]));
       for (const b of branches) state.completedStages.push(b.branch);
-      state.completedStages.push(stage.name);
+      ;
     } catch (e) {
       this.setStatus(runId, "failed");
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (30.2974ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (23.0296ms)

✔ all-lowRiskSkip run completes immediately on advance (17.2519ms)

✔ template registry loads shipped workflow templates without issues (63.8867ms)

[Killed] BlockStatement
packages/orchestration/src/workflow.ts:240:17
       state[stage.name] = Object.fromEntries(branches.map((b) => [b.branch, b.output]));
       for (const b of branches) state.completedStages.push(b.branch);
       state.completedStages.push(stage.name);
-    } catch (e) {
-      this.setStatus(runId, "failed");
-      throw e instanceof AppError ? e : new AppError("INTERNAL", `fan-out '${stage.name}' failed`, { cause: e });
-    }
+    } catch (e) {}
 
     const nextIdx = idx + 1;
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (33.9419ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (19.3264ms)

✔ all-lowRiskSkip run completes immediately on advance (21.4061ms)

✔ template registry loads shipped workflow templates without issues (58.6679ms)

[Killed] StringLiteral
packages/orchestration/src/workflow.ts:241:29
       for (const b of branches) state.completedStages.push(b.branch);
       state.completedStages.push(stage.name);
     } catch (e) {
-      this.setStatus(runId, "failed");
+      this.setStatus(runId, "");
       throw e instanceof AppError ? e : new AppError("INTERNAL", `fan-out '${stage.name}' failed`, { cause: e });
     }
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (29.0769ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (17.4838ms)

✔ all-lowRiskSkip run completes immediately on advance (17.0975ms)

✔ template registry loads shipped workflow templates without issues (57.7162ms)

[Killed] EqualityOperator
packages/orchestration/src/workflow.ts:246:9
     }
 
     const nextIdx = idx + 1;
-    if (nextIdx >= stages.length) {
+    if (nextIdx < stages.length) {
       this.db.transaction(() => {
         this.persistState(runId, state, "__done__");
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (36.9776ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (31.6856ms)

✔ all-lowRiskSkip run completes immediately on advance (27.1692ms)

✔ template registry loads shipped workflow templates without issues (99.4924ms)

[Killed] BlockStatement
packages/orchestration/src/workflow.ts:258:95
     return { status: "running", currentStage: next.name };
   }
 
-  pauseForApproval(runId: string, action: string, resourceRef: Record<string, unknown>): void {
-    const row = this.getRunRow(runId);
-    const state = JSON.parse(row.state_json) as Record<string, unknown>;
-    state.pendingApproval = { action, ...resourceRef };
-    this.db.transaction(() => {
-      this.persistState(runId, state);
-      this.setStatus(runId, "waiting_approval");
-    });
-  }
+  pauseForApproval(runId: string, action: string, resourceRef: Record<string, unknown>): void {}
 
   resume(runId: string): { status: string; currentStage: string | null } {
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (29.0104ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (22.7479ms)

✔ all-lowRiskSkip run completes immediately on advance (18.7422ms)

✔ template registry loads shipped workflow templates without issues (63.739ms)

[Killed] BlockStatement
packages/orchestration/src/workflow.ts:262:31
     const row = this.getRunRow(runId);
     const state = JSON.parse(row.state_json) as Record<string, unknown>;
     state.pendingApproval = { action, ...resourceRef };
-    this.db.transaction(() => {
-      this.persistState(runId, state);
-      this.setStatus(runId, "waiting_approval");
-    });
+    this.db.transaction(() => {});
   }
 
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (36.0328ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (24.0964ms)

✔ all-lowRiskSkip run completes immediately on advance (16.2967ms)

✔ template registry loads shipped workflow templates without issues (66.0537ms)

[Killed] CallExpression
packages/orchestration/src/workflow.ts:263:7
     const state = JSON.parse(row.state_json) as Record<string, unknown>;
     state.pendingApproval = { action, ...resourceRef };
     this.db.transaction(() => {
-      this.persistState(runId, state);
+      ;
       this.setStatus(runId, "waiting_approval");
     });
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (24.1865ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (16.421ms)

✔ all-lowRiskSkip run completes immediately on advance (15.2755ms)

✔ template registry loads shipped workflow templates without issues (67.2246ms)
