[Killed] BlockStatement
packages/orchestration/src/workflow.ts:268:74
     });
   }
 
-  resume(runId: string): { status: string; currentStage: string | null } {
-    const row = this.getRunRow(runId);
-    if (row.status !== "waiting_approval" && row.status !== "paused" && row.status !== "blocked") {
-      throw new AppError("CONFLICT", `cannot resume run in status ${row.status}`);
-    }
-    this.setStatus(runId, "running");
-    return { status: "running", currentStage: String(row.current_stage) };
-  }
+  resume(runId: string): { status: string; currentStage: string | null } {}
 
   getState(orgId: string, runId: string): Row {
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (24.1755ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (16.2913ms)

✔ all-lowRiskSkip run completes immediately on advance (17.0122ms)

✔ template registry loads shipped workflow templates without issues (62.7626ms)

[Killed] EqualityOperator
packages/orchestration/src/workflow.ts:270:9
 
   resume(runId: string): { status: string; currentStage: string | null } {
     const row = this.getRunRow(runId);
-    if (row.status !== "waiting_approval" && row.status !== "paused" && row.status !== "blocked") {
+    if (row.status === "waiting_approval" && row.status !== "paused" && row.status !== "blocked") {
       throw new AppError("CONFLICT", `cannot resume run in status ${row.status}`);
     }
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (23.4364ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (16.1535ms)

✔ all-lowRiskSkip run completes immediately on advance (16.4507ms)

✔ template registry loads shipped workflow templates without issues (55.0774ms)

[Killed] EqualityOperator
packages/orchestration/src/workflow.ts:270:73
 
   resume(runId: string): { status: string; currentStage: string | null } {
     const row = this.getRunRow(runId);
-    if (row.status !== "waiting_approval" && row.status !== "paused" && row.status !== "blocked") {
+    if (row.status !== "waiting_approval" && row.status !== "paused" && row.status === "blocked") {
       throw new AppError("CONFLICT", `cannot resume run in status ${row.status}`);
     }
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (27.4872ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (15.1599ms)

✔ all-lowRiskSkip run completes immediately on advance (15.7061ms)

✔ template registry loads shipped workflow templates without issues (56.1877ms)

[Killed] BlockStatement
packages/orchestration/src/workflow.ts:277:47
     return { status: "running", currentStage: String(row.current_stage) };
   }
 
-  getState(orgId: string, runId: string): Row {
-    const row = this.db.get("SELECT * FROM workflow_runs WHERE id = ? AND org_id = ?", [runId, orgId]);
-    if (!row) throw new AppError("NOT_FOUND", "workflow run not found");
-    return row;
-  }
+  getState(orgId: string, runId: string): Row {}
 
   private getRunRow(runId: string): {
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (22.7877ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (15.6883ms)

✔ all-lowRiskSkip run completes immediately on advance (15.0655ms)

✔ template registry loads shipped workflow templates without issues (56.54ms)

[Killed] ConditionalExpression
packages/orchestration/src/workflow.ts:279:9
 
   getState(orgId: string, runId: string): Row {
     const row = this.db.get("SELECT * FROM workflow_runs WHERE id = ? AND org_id = ?", [runId, orgId]);
-    if (!row) throw new AppError("NOT_FOUND", "workflow run not found");
+    if (false) throw new AppError("NOT_FOUND", "workflow run not found");
     return row;
   }
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (27.8116ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (16.54ms)

✔ all-lowRiskSkip run completes immediately on advance (17.0107ms)

✔ template registry loads shipped workflow templates without issues (57.9271ms)

[Killed] BooleanLiteral
packages/orchestration/src/workflow.ts:279:9
 
   getState(orgId: string, runId: string): Row {
     const row = this.db.get("SELECT * FROM workflow_runs WHERE id = ? AND org_id = ?", [runId, orgId]);
-    if (!row) throw new AppError("NOT_FOUND", "workflow run not found");
+    if (row) throw new AppError("NOT_FOUND", "workflow run not found");
     return row;
   }
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (24.6698ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (16.6977ms)

✔ all-lowRiskSkip run completes immediately on advance (15.75ms)

✔ template registry loads shipped workflow templates without issues (58.9868ms)

[Killed] BlockStatement
packages/orchestration/src/workflow.ts:288:5
     status: string;
     current_stage: string;
     state_json: string;
-  } {
-    const row = this.db.get("SELECT id, status, current_stage, state_json FROM workflow_runs WHERE id = ?", [
-      runId,
-    ]) as { id: string; status: string; current_stage: string; state_json: string } | undefined;
-    if (!row) throw new AppError("NOT_FOUND", `workflow run ${runId} not found`);
-    return row;
-  }
+  } {}
 
   private persistState(runId: string, state: unknown, currentStageOverride?: string): void {
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (25.7807ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (17.6543ms)

✔ all-lowRiskSkip run completes immediately on advance (15.3144ms)

✔ template registry loads shipped workflow templates without issues (56.3079ms)

[Killed] BooleanLiteral
packages/orchestration/src/workflow.ts:292:9
     const row = this.db.get("SELECT id, status, current_stage, state_json FROM workflow_runs WHERE id = ?", [
       runId,
     ]) as { id: string; status: string; current_stage: string; state_json: string } | undefined;
-    if (!row) throw new AppError("NOT_FOUND", `workflow run ${runId} not found`);
+    if (row) throw new AppError("NOT_FOUND", `workflow run ${runId} not found`);
     return row;
   }
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (25.8375ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (15.8435ms)

✔ all-lowRiskSkip run completes immediately on advance (15.8427ms)

✔ template registry loads shipped workflow templates without issues (57.9276ms)

[Killed] ConditionalExpression
packages/orchestration/src/workflow.ts:292:9
     const row = this.db.get("SELECT id, status, current_stage, state_json FROM workflow_runs WHERE id = ?", [
       runId,
     ]) as { id: string; status: string; current_stage: string; state_json: string } | undefined;
-    if (!row) throw new AppError("NOT_FOUND", `workflow run ${runId} not found`);
+    if (true) throw new AppError("NOT_FOUND", `workflow run ${runId} not found`);
     return row;
   }
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (28.8584ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (20.0991ms)

✔ all-lowRiskSkip run completes immediately on advance (16.2256ms)

✔ template registry loads shipped workflow templates without issues (57.5183ms)

[Killed] BlockStatement
packages/orchestration/src/workflow.ts:296:92
     return row;
   }
 
-  private persistState(runId: string, state: unknown, currentStageOverride?: string): void {
-    const patch: Record<string, unknown> = {
-      state_json: JSON.stringify(state),
-      updated_at: this.db.now(),
-    };
-    if (currentStageOverride) patch.current_stage = currentStageOverride;
-    this.db.updateById("workflow_runs", runId, patch);
-  }
+  private persistState(runId: string, state: unknown, currentStageOverride?: string): void {}
 
   private setStatus(runId: string, status: string): void {
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (24.4556ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (16.0353ms)

✔ all-lowRiskSkip run completes immediately on advance (16.2855ms)

✔ template registry loads shipped workflow templates without issues (59.9566ms)

[Killed] ConditionalExpression
packages/orchestration/src/workflow.ts:301:9
       state_json: JSON.stringify(state),
       updated_at: this.db.now(),
     };
-    if (currentStageOverride) patch.current_stage = currentStageOverride;
+    if (true) patch.current_stage = currentStageOverride;
     this.db.updateById("workflow_runs", runId, patch);
   }
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (26.8688ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (16.3785ms)

✔ all-lowRiskSkip run completes immediately on advance (15.4472ms)

✔ template registry loads shipped workflow templates without issues (56.0074ms)

[Killed] ConditionalExpression
packages/orchestration/src/workflow.ts:301:9
       state_json: JSON.stringify(state),
       updated_at: this.db.now(),
     };
-    if (currentStageOverride) patch.current_stage = currentStageOverride;
+    if (false) patch.current_stage = currentStageOverride;
     this.db.updateById("workflow_runs", runId, patch);
   }
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (27.171ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (16.8602ms)

✔ all-lowRiskSkip run completes immediately on advance (16.1048ms)

✔ template registry loads shipped workflow templates without issues (64.4761ms)

[Killed] StringLiteral
packages/orchestration/src/workflow.ts:302:24
       updated_at: this.db.now(),
     };
     if (currentStageOverride) patch.current_stage = currentStageOverride;
-    this.db.updateById("workflow_runs", runId, patch);
+    this.db.updateById("", runId, patch);
   }
 
killedBy: All tests
statusReason: ✖ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (23.094ms)

✖ medium-risk run does NOT skip lowRiskSkip stages (15.2225ms)

✖ all-lowRiskSkip run completes immediately on advance (17.837ms)

✔ template registry loads shipped workflow templates without issues (63.8255ms)

[Killed] BlockStatement
packages/orchestration/src/workflow.ts:305:58
     this.db.updateById("workflow_runs", runId, patch);
   }
 
-  private setStatus(runId: string, status: string): void {
-    this.db.updateById("workflow_runs", runId, { status, updated_at: this.db.now() });
-  }
+  private setStatus(runId: string, status: string): void {}
 }
 
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (26.5179ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (16.9796ms)

✔ all-lowRiskSkip run completes immediately on advance (17.9235ms)

✔ template registry loads shipped workflow templates without issues (61.168ms)

[Killed] BlockStatement
packages/orchestration/src/workflow.ts:312:65
 
 type Row = Record<string, unknown>;
 
-export function defaultWorkflowDefinition(): WorkflowDefinition {
-  return structuredClone(DEFAULT_WORKFLOW);
-}
+export function defaultWorkflowDefinition(): WorkflowDefinition {}
 
killedBy: All tests
statusReason: ✔ workflow low-risk run skips stages flagged lowRiskSkip (audit Phase 2.2) (23.5785ms)

✔ medium-risk run does NOT skip lowRiskSkip stages (14.4058ms)

✔ all-lowRiskSkip run completes immediately on advance (14.8283ms)

✔ template registry loads shipped workflow templates without issues (54.381ms)
